
&НаСервере
Процедура СкопироватьДанныеНаСервере()
	
	Если Метаданные.РегистрыСведений.Найти("сс_РегистрацияДокументов") <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	сс_РегистрацияДокументов.Период КАК Период,
			|	сс_РегистрацияДокументов.Документ КАК Документ,
			|	сс_РегистрацияДокументов.Пользователь КАК Пользователь,
			|	сс_РегистрацияДокументов.Статус КАК Статус,
			|	сс_РегистрацияДокументов.Комментарий КАК Комментарий
			|ИЗ
			|	РегистрСведений.сс_РегистрацияДокументов КАК сс_РегистрацияДокументов";
		
		РезультатЗапроса = Запрос.Выполнить();
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	сс_УдалитьРегистрацияДокументов.Период КАК Период,
			|	сс_УдалитьРегистрацияДокументов.Документ КАК Документ,
			|	сс_УдалитьРегистрацияДокументов.Пользователь КАК Пользователь,
			|	сс_УдалитьРегистрацияДокументов.Статус КАК Статус,
			|	сс_УдалитьРегистрацияДокументов.Комментарий КАК Комментарий
			|ИЗ
			|	РегистрСведений.сс_УдалитьРегистрацияДокументов КАК сс_УдалитьРегистрацияДокументов";
		
		РезультатЗапроса = Запрос.Выполнить();
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выгрузить();
	
	НаборЗаписей = РегистрыСведений.сс_РегистрацияСтатусов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Выборка);
	НаборЗаписей.Записать(Истина);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Данные были скопированы. Всего строк: " + НаборЗаписей.Количество();
	Сообщение.Сообщить();
	
	ПолучитьКолДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДанные(Команда)
	СкопироватьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Метаданные.РегистрыСведений.Найти("сс_РегистрацияСтатусов") = Неопределено Тогда
		Сообщить("Эта обработка предназначена для другой конфигурации");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыНаСервере()	
	
	НаборЗаписей = РегистрыСведений.сс_РегистрацияСтатусов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	КолИзм = 0;
	Для каждого Строка Из НаборЗаписей Цикл
		Если Строка.Вид.Пустая() Или Строка.Вид = Перечисления.сс_ВидыРегистрацииСтатусов.Другой Тогда
			КолИзм = КолИзм + 1;
			Если ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.ТТН") Тогда
				Строка.Вид = Перечисления.сс_ВидыРегистрацииСтатусов.ТТН;
			ИначеЕсли ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
				Или ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.СчетФактураВыданный")
				Или ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")				
				Тогда
				Строка.Вид = Перечисления.сс_ВидыРегистрацииСтатусов.УПД;
			ИначеЕсли ТипЗнч(Строка.Документ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Строка.Вид = Перечисления.сс_ВидыРегистрацииСтатусов.Договор;
			Иначе
				Строка.Вид = Перечисления.сс_ВидыРегистрацииСтатусов.Другой;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
		
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Данные были изменены. Всего строк: " + НаборЗаписей.Количество() + ". Изменненых: " + КолИзм;
	Сообщение.Сообщить();
	
	ПолучитьКолДанных();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВиды(Команда)
	ЗаполнитьВидыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКолДанных()
		
	Если Метаданные.РегистрыСведений.Найти("сс_РегистрацияДокументов") <> Неопределено Тогда
		Записи = РегистрыСведений.сс_РегистрацияСтатусов.СоздатьНаборЗаписей();
	Иначе
		Записи = РегистрыСведений.сс_УдалитьРегистрацияДокументов.СоздатьНаборЗаписей();
	КонецЕсли;
	Записи.Прочитать();
	КоличествоЗаписей = Записи.Количество();
	
	Записи = РегистрыСведений.сс_РегистрацияСтатусов.СоздатьНаборЗаписей();
	Записи.Прочитать();
	КоличествоЗаписейНовый = Записи.Количество();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьКолДанных();
КонецПроцедуры

