
&НаСервере
Процедура ЗаменитьЗначенияНаСервере()
		
	РегистрацияСтатусов = РегистрыСведений.сс_РегистрацияСтатусов.СоздатьНаборЗаписей();
	РегистрацияСтатусов.Прочитать();
	
	Если ИспользоватьВид И ИспользоватьСтатус Тогда
		Для каждого Строка Из РегистрацияСтатусов Цикл
			Если Строка.Вид = ПриемникВид И Строка.Статус = ПриемникСтатус Тогда	
				Если ЗаменитьВид И ЗаменитьСтатус Тогда 
					Строка.Вид = ИсточникВид;
					Строка.Статус = ИсточникСтатус;
				ИначеЕсли ЗаменитьВид Тогда 	
					Строка.Вид = ИсточникВид;
				ИначеЕсли ЗаменитьСтатус Тогда 	
					Строка.Статус = ИсточникСтатус;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ИспользоватьВид Тогда
		Для каждого Строка Из РегистрацияСтатусов Цикл
			Если Строка.Вид = ПриемникВид Тогда	
				Если ЗаменитьВид И ЗаменитьСтатус Тогда 
					Строка.Вид = ИсточникВид;
					Строка.Статус = ИсточникСтатус;
				ИначеЕсли ЗаменитьВид Тогда 	
					Строка.Вид = ИсточникВид;
				ИначеЕсли ЗаменитьСтатус Тогда 	
					Строка.Статус = ИсточникСтатус;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ИспользоватьСтатус Тогда
		Для каждого Строка Из РегистрацияСтатусов Цикл
			Если Строка.Статус = ПриемникСтатус Тогда	
				Если ЗаменитьВид И ЗаменитьСтатус Тогда 
					Строка.Вид = ИсточникВид;
					Строка.Статус = ИсточникСтатус;
				ИначеЕсли ЗаменитьВид Тогда 	
					Строка.Вид = ИсточникВид;
				ИначеЕсли ЗаменитьСтатус Тогда 	
					Строка.Статус = ИсточникСтатус;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого Строка Из РегистрацияСтатусов Цикл
			Если ЗаменитьВид И ЗаменитьСтатус Тогда 
				Строка.Вид = ИсточникВид;
				Строка.Статус = ИсточникСтатус;
			ИначеЕсли ЗаменитьВид Тогда 	
				Строка.Вид = ИсточникВид;
			ИначеЕсли ЗаменитьСтатус Тогда 	
				Строка.Статус = ИсточникСтатус;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РегистрацияСтатусов.Записать(Истина);
	Элементы.СписокРегистра.Обновить();
	
	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьЗначения(Команда)
	
	Если Не ЗаменитьВид И Не ЗаменитьСтатус Тогда
		Сообщить("Не была установлена галочка для замены");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗаменитьЗначенияВопрос", ЭтотОбъект);
	  
	ПоказатьВопрос(Оповещение,
		"Данные будут изменены безвозвратно. Продолжить?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьЗначенияВопрос(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() Тогда
			ЗаменитьЗначенияНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуНаСервере()
	
	ОтборНайденВид = Ложь;
	ОтборНайденСтатус = Ложь;
	Для каждого ЭлементОтбора Из СписокРегистра.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид") Тогда
			ОтборНайденВид = Истина;
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус") Тогда
			ОтборНайденСтатус = Истина;
		КонецЕсли;			
	КонецЦикла;
	
	Если Не ОтборНайденВид Тогда
		ОтборВид = СписокРегистра.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборВид.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид");	
	КонецЕсли;
	
	Если Не ОтборНайденСтатус Тогда
		ОтборСтатус = СписокРегистра.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборСтатус.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	КонецЕсли;		
	
	Для каждого ЭлементОтбора Из СписокРегистра.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вид") Тогда
			ЭлементОтбора.Использование  = ИспользоватьВид;
			ЭлементОтбора.ПравоеЗначение = ПриемникВид;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус") Тогда
			ЭлементОтбора.Использование  = ИспользоватьСтатус;
			ЭлементОтбора.ПравоеЗначение = ПриемникСтатус;
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;			
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	сс_РегистрацияСтатусов.Вид КАК Вид,
		|	сс_РегистрацияСтатусов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.сс_РегистрацияСтатусов КАК сс_РегистрацияСтатусов";
		
	Если ИспользоватьВид И ИспользоватьСтатус Тогда 
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + 
		"ГДЕ
		|	сс_РегистрацияСтатусов.Вид = &Вид
		|	И сс_РегистрацияСтатусов.Статус = &Статус";
		
		Запрос.УстановитьПараметр("Вид", ПриемникВид);
		Запрос.УстановитьПараметр("Статус", ПриемникСтатус);
		
	ИначеЕсли ИспользоватьВид Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + 
		"ГДЕ
		|	сс_РегистрацияСтатусов.Вид = &Вид";
		Запрос.УстановитьПараметр("Вид", ПриемникВид);
	ИначеЕсли ИспользоватьСтатус Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + 
		"ГДЕ
		|	сс_РегистрацияСтатусов.Статус = &Статус";
		Запрос.УстановитьПараметр("Статус", ПриемникСтатус);
	КонецЕсли;
	
	Если НайтиБитыеСсылки Тогда
		Если СтрНайти(СписокРегистра.ТекстЗапроса, "ГДЕ") > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + 
			"	И (сс_РегистрацияСтатусов.Документ ЕСТЬ NULL
			|	ИЛИ сс_РегистрацияСтатусов.ДокументДоп ЕСТЬ NULL)";
		Иначе	
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + 
			"ГДЕ
			|	(сс_РегистрацияСтатусов.Документ ЕСТЬ NULL
			|	ИЛИ сс_РегистрацияСтатусов.ДокументДоп ЕСТЬ NULL)";
		КонецЕсли;
		Если СтрНайти(СписокРегистра.ТекстЗапроса, "ГДЕ") > 0 Тогда
			СписокРегистра.ТекстЗапроса = СписокРегистра.ТекстЗапроса + Символы.ПС + 
			"	И (сс_РегистрацияСтатусов.Документ ЕСТЬ NULL
			|	ИЛИ сс_РегистрацияСтатусов.ДокументДоп ЕСТЬ NULL)";
		Иначе 
			СписокРегистра.ТекстЗапроса = СписокРегистра.ТекстЗапроса + Символы.ПС + 
			"ГДЕ
			|	(сс_РегистрацияСтатусов.Документ ЕСТЬ NULL
			|	ИЛИ сс_РегистрацияСтатусов.ДокументДоп ЕСТЬ NULL)";
		КонецЕсли;
	Иначе
		Если СтрНайти(СписокРегистра.ТекстЗапроса, "ГДЕ") > 0 Тогда
			СписокРегистра.ТекстЗапроса = СтрЗаменить(СписокРегистра.ТекстЗапроса, 
			"	И (сс_РегистрацияСтатусов.Документ ЕСТЬ NULL
			|	ИЛИ сс_РегистрацияСтатусов.ДокументДоп ЕСТЬ NULL)", "");

			СписокРегистра.ТекстЗапроса = СтрЗаменить(СписокРегистра.ТекстЗапроса,
			"ГДЕ
			|	(сс_РегистрацияСтатусов.Документ ЕСТЬ NULL
			|	ИЛИ сс_РегистрацияСтатусов.ДокументДоп ЕСТЬ NULL)", "");
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	КоличествоЗаписей = РезультатЗапроса.Выбрать().Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицу(Команда)
	ОбновитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Метаданные.РегистрыСведений.Найти("сс_РегистрацияСтатусов") = Неопределено Тогда
		Сообщить("Эта обработка предназначена для другой конфигурации");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбновитьТаблицуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВидПриИзменении(Элемент)
	ОбновитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтатусПриИзменении(Элемент)
	ОбновитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриемникВидПриИзменении(Элемент)
	ИспользоватьВид = Истина;
	ОбновитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриемникСтатусПриИзменении(Элемент)
	ИспользоватьСтатус = Истина;
	ОбновитьТаблицуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЗапись_сс_РегистрацииСтатусов(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Команда.ИспользуемаяТаблица.ТекущаяСтрока);
	ОткрытьФормуОбработки(Команда, ПараметрыОткрытия);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОбработки(Команда, ПараметрыОткрытия = Неопределено)
	
	ОткрытьФорму(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".", НаправлениеПоиска.СКонца)) + Команда.Имя, ПараметрыОткрытия);

КонецПроцедуры // ОткрытьФормуОбработки()

&НаКлиенте
Процедура СписокРегистраВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ВыбраннаяСтрока);
	ОткрытьФормуОбработки(Команды.Найти("ИзменитьЗапись_сс_РегистрацииСтатусов"), ПараметрыОткрытия);	
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиБитыеСсылкиПриИзменении(Элемент)
	ОбновитьТаблицуНаСервере();
КонецПроцедуры


