
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПолучитьПароль", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПароль()

	ВыбранныйЭлемент = Элементы.Список.ТекущиеДанные.Владелец;
	Пароль = ПолучитьПарольНаСервере(ВыбранныйЭлемент);

КонецПроцедуры // ПолучитьПарольПочты()

&НаСервереБезКонтекста
Функция ПолучитьПарольНаСервере(ВладелецПароля)

	ПолученноеЗначение = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецПароля, "Пароль");
	Если ТипЗнч(ПолученноеЗначение) = Тип("Строка") Тогда
		Возврат ПолученноеЗначение;
	КонецЕсли;

КонецФункции // ПолучитьПарольПочтыНаСервере()

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Пароль = Элемент.ТекстРедактирования;
	Элемент.РежимПароля = Не Элемент.РежимПароля;
	Если Элемент.РежимПароля Тогда
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыСкрыты;
	Иначе
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыВидны;
	КонецЕсли;

КонецПроцедуры
