&НаКлиенте
Процедура СсылкаВКНажатие(Элемент)

	СкопироватьВБуферОбменаТекст("https://vk.com/heart_machine");

КонецПроцедуры

&НаКлиенте
Процедура СсылкаТелегаНажатие(Элемент)

	СкопироватьВБуферОбменаТекст("https://t.me/heart_machine");

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуферОбменаТекст(Текст)

#Если ТонкийКлиент Или ТолстыйКлиентОбычноеПриложение Или ТолстыйКлиентУправляемоеПриложение Тогда
	ПутьВременногоФайла = ПолучитьИмяВременногоФайла();
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(Текст);
	ТД.Записать(ПутьВременногоФайла, КодировкаТекста.OEM, Символы.ВК + Символы.ПС);
	КомОбъект = Новый COMОбъект("WScript.Shell");
	КомОбъект.Run("%comspec% /c type """ + ПутьВременногоФайла + """ | clip & del """ + ПутьВременногоФайла + """", 0,
		0);
	КомОбъект = Неопределено;
	УдалитьФайлы(ПутьВременногоФайла);

	ПоказатьОповещениеПользователя("Ссылка скопирована", , Текст, БиблиотекаКартинок.УстановитьФлажки);
#КонецЕсли

КонецПроцедуры // СкопироватьВБуферОбменаТекст()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Обработка = РеквизитФормыВЗначение("Объект");
	Элементы.ОписаниеПрограммы.Заголовок = Новый ФорматированнаяСтрока(Элементы.ОписаниеПрограммы.Заголовок,
		Новый ФорматированнаяСтрока(Обработка.ПолучитьВерсиюОбратотки(), Новый Шрифт("Tahoma", 9, Истина)));

КонецПроцедуры