
&НаСервере
Процедура ИзменитьФИОНаСервере()
	
	Для каждого Строка Из Табл Цикл
		Справочник = Строка.Ссылка.ПолучитьОбъект();
		
		МассивФам = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Строка.Фамилия, " ");
		
		Если Строка.Изменен Тогда
			
			Справочник.Фамилия = Строка.Фамилия;
			Справочник.Имя = Строка.Имя;
			Справочник.Отчество = Строка.Отчество;
			Справочник.ОбменДанными.Загрузка = Истина;
			Справочник.Записать();
			
		ИначеЕсли МассивФам.Количество() = 3 Тогда
			
			Справочник.Фамилия = МассивФам[0];
			Справочник.Имя = МассивФам[1];
			Справочник.Отчество = МассивФам[2];
			Справочник.ОбменДанными.Загрузка = Истина;
			Справочник.Записать();
			
		ИначеЕсли МассивФам.Количество() = 2 И (СтрДлина(МассивФам[1]) = 4 Или СтрДлина(МассивФам[1]) = 3) Тогда
			
			Попытка
				МассивИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(МассивФам[1], ".");
				Справочник.Фамилия = МассивФам[0];
				Справочник.Имя = МассивИО[0] + ".";
				Справочник.Отчество = МассивИО[1] + ".";
				Справочник.ОбменДанными.Загрузка = Истина;
				Справочник.Записать();
			Исключение 
				Сообщить(Строка(Строка.Ссылка + " не был исправлен, проверьте вручную!"));
			КонецПопытки;
			
		ИначеЕсли МассивФам.Количество() = 4 Тогда
			
			Справочник.Фамилия = МассивФам[0];
			Справочник.Имя = МассивФам[1];
			Справочник.Отчество = МассивФам[2] + " " + МассивФам[3];
			Справочник.ОбменДанными.Загрузка = Истина;
			Справочник.Записать();
			
		Иначе
			Продолжить;			
		КонецЕсли;
		
		Строка.Фамилия = Справочник.Фамилия;
		Строка.Имя = Справочник.Имя;
		Строка.Отчество = Справочник.Отчество;
		
	КонецЦикла;
	Сообщить("Справочники записаны!");
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФИО(Команда)
	ИзменитьФИОНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТаблСервер();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблСервер()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛица.Ссылка КАК Ссылка,
		|	КонтактныеЛица.Фамилия КАК Фамилия,
		|	КонтактныеЛица.Имя КАК Имя,
		|	КонтактныеЛица.Отчество КАК Отчество
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фамилия,
		|	Имя,
		|	Отчество";
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выгрузить();
	Табл.Загрузить(Выборка);

КонецПроцедуры

&НаКлиенте
Процедура ТаблФамилияПриИзменении(Элемент)
	Если СправочникИзменен(Элементы.Табл.ТекущиеДанные.Ссылка, Элементы.Табл.ТекущиеДанные.Фамилия, "Фамилия") Тогда
		Элементы.Табл.ТекущиеДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблИмяПриИзменении(Элемент)
	Если СправочникИзменен(Элементы.Табл.ТекущиеДанные.Ссылка, Элементы.Табл.ТекущиеДанные.Имя, "Имя") Тогда
		Элементы.Табл.ТекущиеДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблОтчествоПриИзменении(Элемент)
	Если СправочникИзменен(Элементы.Табл.ТекущиеДанные.Ссылка, Элементы.Табл.ТекущиеДанные.Отчество, "Отчество") Тогда
		Элементы.Табл.ТекущиеДанные.Изменен = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СправочникИзменен(Справочник, Данные, Вид)

	Если Вид = "Фамилия" Тогда
		Если Данные = Справочник.Фамилия Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли Вид = "Имя" Тогда
		Если Данные = Справочник.Имя Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли Вид = "Отчество" Тогда	
		Если Данные = Справочник.Отчество Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // СправочникИзменен()

&НаКлиенте
Процедура ОбновитьТабл(Команда)
	ОбновитьТаблСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонтактноеЛицо(Команда)
	
	Для каждого НомерСтроки Из Команда.ИспользуемаяТаблица.ВыделенныеСтроки Цикл
	    Ссылка = Команда.ИспользуемаяТаблица.ДанныеСтроки(НомерСтроки).Ссылка;
		Описание = Новый ОписаниеОповещения;
		ПоказатьЗначение(Описание, Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ТаблСсылка" Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

